//*****************************************************************************
//
// CBackgroundクラス [background.h]
// Author :MAI TANABE
//
//*****************************************************************************

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// インクルードファイル
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#include "background.h"

#include "listObject.h"

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// マクロ
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// 静的変数
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//=============================================================================
// コンストラクタ
//=============================================================================
CBackground::CBackground(int priority, OBJTYPE objType) : CScene2D(priority, objType)
{
	m_next = nullptr;
	m_prev = nullptr;
}

//=============================================================================
// 生成
//=============================================================================
CBackground* CBackground::Create(LPDIRECT3DDEVICE9 device, BG_DATA data)
{
	CBackground* pointer = new CBackground;
	pointer->Init(device, (CImport::TEXTURES)(CImport::FOREST_01 + data.type));
	pointer->SetPos((float)(data.index * SCREEN_WIDTH), 0.0f);
	return pointer;
}

//=============================================================================
// 初期化
//=============================================================================
HRESULT CBackground::Init(LPDIRECT3DDEVICE9 device, CImport::TEXTURES texture)
{
	CScene2D::Init(device, texture, CScene2D::POINT_LEFTTOP);
	SetSize(SCREEN_WIDTH, SCREEN_HEIGHT);

	return S_OK;
}

//=============================================================================
// 終了
//=============================================================================
void CBackground::Uninit(void)
{
	CScene2D::Uninit();
}

//=============================================================================
// 更新
//=============================================================================
void CBackground::Update(void)
{
	// 画面外カリング
	if(m_draw && (m_pos.x < -SCREEN_WIDTH || m_pos.x > (SCREEN_WIDTH + 128)))
	{
		CListObject::UnlinkDraw(this);
		m_draw = false;
	}
	else if(!m_draw)
	{
		CListObject::LinkDraw(this, GetPriority());
		m_draw = true;
	}

	CScene2D::Update();
}

//=============================================================================
// 描画
//=============================================================================
void CBackground::Draw(void)
{
	CScene2D::Draw();
}
