//*****************************************************************************
//
// CBackgroundクラス [background.h]
// Author :MAI TANABE
//
//*****************************************************************************

#ifndef _MY_BACKGROUND_H
#define _MY_BACKGROUND_H
//=============================================================================

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// インクルードファイル
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#include "main.h"
/*
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// マクロ定義
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// クラス定義
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
class CBackground
{
public:
	typedef enum
	{
		BG_CTY,
		BG_JUNGLE,
		BG_MAX
	} BGTYPE;

	CBackground(void);
	~CBackground(){};

	static CBackground* Create(LPDIRECT3DDEVICE9 device, BGTYPE type);
	HRESULT	Init(LPDIRECT3DDEVICE9 device, BGTYPE type);
	void	Uninit(void);
	void	Update(void);

private:
	float m_scroll;

	CScene2D** m_sky;	// 空
	CScene2D** m_obj;	// 背景物
	CScene2D** m_wall;	// 背景遮蔽物
};
*/
//=============================================================================
#endif