//*****************************************************************************
//
// ゲームオーバー画面制御クラス [gameover.h]
// Author :YUKI SAKAMOTO
//
//*****************************************************************************

#ifndef _MY_GAMEOVER_H
#define _MY_GAMEOVER_H
//=============================================================================

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// インクルードファイル
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#include "main.h"
#include "phase.h"

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// クラス定義
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
class CScene2D;

class CGameOver : CPhase
{
public:
	CGameOver(void){};
	~CGameOver(){};

	HRESULT	Init(LPDIRECT3DDEVICE9 device);
	void	Uninit(void);
	void	Update(void);
	void	Draw(void);

private:
	void InitObject(LPDIRECT3DDEVICE9 device);

	CScene2D* m_version;
};

//=============================================================================
#endif
