//=============================================================================
//
// パーティクル管理クラス [particle_manager.h]
// Author :YUKI SAKAMOTO
//
//=============================================================================
#ifndef _PARTICLE_MANAGER_H
#define _PARTICLE_MANAGER_H
//=============================================================================
// インクルード
//============================================================================
#include "particle_object.h"
//=============================================================================
// マクロ
//============================================================================
const int PARTICLE_MAX = 40;
//=============================================================================
// 前方宣言
//=============================================================================

//=============================================================================
// クラス定義
//=============================================================================
class CParticleManager
{
public:
	CParticleManager();
	~CParticleManager();

	//初期化
	void Init(LPDIRECT3DDEVICE9 device);

	//パーティクルオブジェクトの取得
	//第一引数:取得したいパーティクルのID
	CParticleObject* object_(int id)
	{
		return (object[id]);
	}

	//パーティクルの生成開始
	void Start();

	//全パーティクルの停止
	void StopALL();

private:
	CParticleObject* object[PARTICLE_MAX];
};

#endif

