//=============================================================================
//
// プレイヤーの各種設定情報 [player_config.h]
// Author :YUKI SAKAMOTO
//
//=============================================================================
#ifndef _PLAYER_CONFIG_H
#define _PLAYER_CONFIG_H
//=============================================================================
// 設定情報
//=============================================================================

//ジャンプ力
const float JUMP_SPD              = -40.0f;
//移動スピード
const float MOVE_SPD              = 3.0f;
//重力
const float GRAVITY_SPD           = 2.0f;
//攻撃アニメーションスピード
const int   ATTACK_ANIM_SPD       = 10;
//移動時の摩擦力
const float MOVE_FRICTIONAL_FORCE = 0.8f;

#endif

