//*****************************************************************************
//
// thr_objクラス [thr_obj.h]
// Author :KAZUMA OOIGAWA
//
//*****************************************************************************

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// インクルードファイル
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
#include "thr_obj.h"

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// マクロ定義
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// 静的変数
//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
//=============================================================================
// コンストラクタ
//=============================================================================
CThrObj::CThrObj( int priority , OBJTYPE objtype ) : CScene2D( priority , objtype )
{
}
//=============================================================================
// 生成
//=============================================================================
CThrObj* CThrObj::Create( LPDIRECT3DDEVICE9 device , CImport::TEXTURES texture , POINT_TYPE pointType , int priority , D3DXVECTOR2 pos )
{
	CThrObj* pointer = new CThrObj( priority , OBJTYPE_2D );
	pointer->Init(device, texture, pointType);
	pointer->SetPos( pos );
	pointer->SetThrObj( pointer );
	return pointer;
}

CThrObj* CThrObj::Create(LPDIRECT3DDEVICE9 device, const char* texture , POINT_TYPE pointType , int priority , D3DXVECTOR2 pos )
{
	CThrObj* pointer = new CThrObj( priority , OBJTYPE_2D );
	pointer->Init(device, texture, pointType);
	pointer->SetPos( pos );
	pointer->SetThrObj( pointer );
	return pointer;
}
//=============================================================================
// 初期化
//=============================================================================
HRESULT CThrObj::Init( LPDIRECT3DDEVICE9 device , CImport::TEXTURES texture , POINT_TYPE pointType )
{
	CScene2D::Init( device , texture , pointType );
	return S_OK;
}

HRESULT	CThrObj::Init(LPDIRECT3DDEVICE9 device, const char* texture, POINT_TYPE pointType)
{
	CScene2D::Init( device , texture , pointType );
	return S_OK;
}

//=============================================================================
// 終了
//=============================================================================
void CThrObj::Uninit( void )
{
	CScene2D::Uninit();
}
//=============================================================================
// ダミー更新
//=============================================================================
void CThrObj::Update( void )
{
	//スレッド用クラスなのでここには何も記述しない
}
//=============================================================================
// ダミー描画
//=============================================================================
void CThrObj::Draw( void )
{
	//スレッド用クラスなのでここには何も記述しない
}
//=============================================================================
// 更新:スレッドから呼ぶ
//=============================================================================
void CThrObj::ThrUpdate( void )
{
	CScene2D::Update();
}
//=============================================================================
// 描画:スレッドから呼ぶ
//=============================================================================
void CThrObj::ThrDraw( void )
{
	CScene2D::Draw();
}
